flameletModel-2.1.x/tutorials/turbulentFlameletRhoSimplecFoam/combustionChamber/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 0 0 1 0 0 0 ];

internalField   uniform 292.15;

boundaryField
{
    inletfuel           
    {
        type  		fixedValue;
 	value 		uniform 292.15;
    }

    inletair           
    {
        type  		fixedValue;
 	value 		uniform 292.15;
    }

    outlet          
    {
        type  		zeroGradient;
    }

    wallheatloose
    {
        type  		fixedValue;
	value		uniform 292.15;
    }

    wallchamber
    {
        type  		zeroGradient;
    }
}


// ************************************************************************* //
