flameletModel-2.1.x/tutorials/turbulentFlameletRhoSimplecFoam/combustionChamber/0.org/csiv2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      csiv2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletfuel           
    {
	type 		fixedValue;
        value           uniform 0;
    }

    inletair           
    {
	type 		fixedValue;
        value           uniform 0;
    }

    outlet          
    {
        type            zeroGradient;
    }

    "wall.*"
    {
        type            zeroGradient;
    }
}
// ************************************************************************* //
